# Taps (sources)
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Install apps in /Applications
cask_args appdir: "/Applications"

# ---------- CLI essentials 
brew "git"
brew "stow"          # manage dotfiles via symlinks
brew "rsync"
brew "gh"
# brew "zsh"
# brew "coreutils"
# brew "findutils"
# brew "gnu-sed"
# brew "ripgrep"       # fast search
# brew "fd"            # find alternative
# brew "jq"            # JSON tools
# brew "yq"            # YAML tools
# brew "fzf"           # fuzzy finder (run: $(brew --prefix)/opt/fzf/install)
# brew "zoxide"        # smarter cd
# brew "eza"           # ls alternative
# brew "tree"
# brew "wget"
# brew "gnupg"

# ---------- Desktop apps (casks) 
cask "1password"
cask "carbon-copy-cloner"
cask "connectmenow"
cask "expressvpn"
cask "figma"
cask "finicky"
cask "hiddenbar"
cask "istat-menus"
cask "iterm2"
cask "keyboardcleantool"
cask "latest"
cask "notion"
cask "obsidian"
cask "raycast"
cask "shottr"
cask "spotify"
cask "stay"
cask "tailscale-app"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
cask "font-jetbrains-mono"

# ---------- App Store apps (mas)
brew "mas"
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "Things", id: 904280696

# ---------- Dev/runtime (keep light) ----------
brew "python@3.13"
# brew "pipx"          # isolated Python CLIs
# brew "node"
# brew "pnpm"
# brew "direnv"        # per-folder envs
# brew "gh"            # GitHub CLI
# brew "httpie"

# ---------- Media & data helpers ----------
# brew "ffmpeg"
# brew "imagemagick"
# brew "exiftool"

# ---------- VS Code extensions
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "yzhang.markdown-all-in-one"
