# reference: https://github.com/vraravam/dotfiles/blob/4dfa90c0846c25b3e08ad660624c3c36f871e3c1/files/--HOME--/Brewfile#L8-L10
# https://github.com/vraravam/dotfiles/tree/4dfa90c0846c25b3e08ad660624c3c36f871e3c1

# Taps (sources)
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/core'

# global preferences for all 'brew install' commands
cask_args appdir: '/Applications', fontdir: '/Library/Fonts', no_quarantine: true, adopt: true

# formulae pulled in from homebrew to replace system equivalents to fix any security issues since the OS was released
brew "codex"
brew "gh"
brew "git"
brew "mas"
brew "rsync"
brew "starship"
brew "stow"
brew "zsh-autosuggestions"

# brew 'zsh'
# brew 'coreutils'
# brew 'findutils'
# brew 'gnu-sed'
# brew 'ripgrep'       # fast search
# brew 'fd'            # find alternative
# brew 'jq'            # JSON tools
# brew 'yq'            # YAML tools
# brew 'fzf'           # fuzzy finder (run: $(brew --prefix)/opt/fzf/install)
# brew 'zoxide'        # smarter cd
# brew 'eza'           # ls alternative
# brew 'tree'
# brew 'wget'
# brew 'gnupg'

# install dev tools and runtimes
brew 'python@3.13'
brew 'pipx'          # isolated Python CLIs
# brew 'node'
# brew 'pnpm'
# brew 'direnv'        # per-folder envs
# brew 'gh'            # GitHub CLI
# brew 'httpie'

# media manipulation tools 
# brew 'ffmpeg'
# brew 'imagemagick'
# brew 'exiftool'

# Install most essential apps directly 
cask "1password"
cask "aldente"
cask "betterdisplay"
cask "carbon-copy-cloner"
cask "chatgpt"
cask "connectmenow"
cask "expressvpn"
cask "figma"
cask "finicky"
cask "fujifilm-x-raw-studio"
cask "istat-menus"
cask "iterm2"
cask "jordanbaird-ice"
cask "keyboardcleantool"
cask "keyclu"
cask "latest"
cask "localsend"
cask "losslesscut"
cask "notion"
cask "notunes"
cask "obsidian"
cask "onyx"
cask "postman"
cask "raycast"
cask "shottr"
cask "soundsource"
cask "spotify"
cask "stay"
cask "tailscale-app"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"


# install Mac App Store apps via `mas`
# mas "iMovie", id: 408981434
# mas "Keynote", id: 409183694
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
mas "Things", id: 904280696
mas "Xcode", id: 497799835


# fonts for the terminal and code editors
cask 'font-jetbrains-mono'
cask 'font-fira-code-nerd-font'

# VS Code extensions
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "ecmel.vscode-html-css"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "kevinrose.vsc-python-indent"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "swiftlang.swift-vscode"
vscode "timonwong.shellcheck"
vscode "tomoki1207.pdf"
vscode "yinfei.luahelper"
vscode "yzhang.markdown-all-in-one"
