davidanson.vscode-markdownlint
docker.docker
dotjoshjohnson.xml
ecmel.vscode-html-css
github.copilot
github.copilot-chat
inferrinizzard.prettier-sql-vscode
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.remote-explorer
redhat.vscode-yaml
yzhang.markdown-all-in-one
